#include <iostream>
using namespace std;

int main()
{
    int a = 21;
    int c;
    /*
    操作符在左边,结果是 先计算 在赋值
    操作符在右边,结果是 先赋值 在计算
    */

    // 赋值运算符，把右边操作数的值赋给左边操作数
    c = a;
    cout << "Line 1 - =  运算符实例，c 的值 = : " << c << endl;

    // 加且赋值运算符，把右边操作数加上左边操作数的结果赋值给左边操作数
    c += a;
    cout << "Line 2 - += 运算符实例，c 的值 = : " << c << endl;

    // 减且赋值运算符，把左边操作数减去右边操作数的结果赋值给左边操作数
    c -= a;
    cout << "Line 3 - -= 运算符实例，c 的值 = : " << c << endl;

    // 乘且赋值运算符，把右边操作数乘以左边操作数的结果赋值给左边操作数
    c *= a;
    cout << "Line 4 - *= 运算符实例，c 的值 = : " << c << endl;

    // 除且赋值运算符，把左边操作数除以右边操作数的结果赋值给左边操作数
    c /= a;
    cout << "Line 5 - /= 运算符实例，c 的值 = : " << c << endl;

    c = 200;
    // 求模且赋值运算符，求两个操作数的模赋值给左边操作数
    c %= a;
    cout << "Line 6 - %= 运算符实例，c 的值 = : " << c << endl;

    // 左移且赋值运算符
    c <<= 2;
    cout << "Line 7 - <<= 运算符实例，c 的值 = : " << c << endl;

    // 右移且赋值运算符
    c >>= 2;
    cout << "Line 8 - >>= 运算符实例，c 的值 = : " << c << endl;

    // 按位与且赋值运算符
    c &= 2;
    cout << "Line 9 - &= 运算符实例，c 的值 = : " << c << endl;

    // 按位异或且赋值运算符
    c ^= 2;
    cout << "Line 10 - ^= 运算符实例，c 的值 = : " << c << endl;

    // 按位或且赋值运算符
    c |= 2;
    cout << "Line 11 - |= 运算符实例，c 的值 = : " << c << endl;


    return 0;
}